PROFANITY_WORDS = {
    "english" : [
    "apeshit", "arse", "arsehole", "ass", "asshat", "asshole", "asswipe", 
    "badass", "ballsack", "bastard", "batshit", "bellend", "bimbo", "bitch", 
    "bitchy", "bollocks", "bugger", "bullcrap", "bullshit", "chickenshit", 
    "clit", "clusterfuck", "cock", "cockblock", "cocksucker", "crap", "cum", 
    "cunt", "dammit", "damn", "dick", "dickbag", "dickhead", "dickweed", 
    "dildo", "dipshit", "dogshit", "douche", "douchebag", "dumbass", 
    "dumbfuck", "foreskin", "fuck", "fuckboy", "fuckery", "fuckface", 
    "fucker", "fucking", "fucknut", "fucktard", "fuckup", "fuckwad", 
    "goddamn", "hell", "ho", "hooker", "horseshit", "jackass", "jizz", 
    "knobhead", "minge", "mofo", "motherfucker", "motherfucking", "nutjob", 
    "nutsack", "pecker", "peckerhead", "piss", "pissed", "prick", "pussy", 
    "schlong", "scrotum", "scumbag", "shag", "shit", "shitbag", "shitbrain", 
    "shithead", "shite", "shitstorm", "shitter", "shitty", "skank", "slut", 
    "slutty", "smartass", "snatch", "taint", "tits", "tosser", "turd", 
    "twat", "twatwaffle", "unfuck", "wank", "wanker", "wankstain", "whore"
] ,
    "chinese" : [
    "二逼", "他妈的", "傻叉", "傻逼", "克星", "全家当", "八婆", "婊子", 
    "妈的", "妈蛋", "妈逼", "妓女", "妈蛋", "妹的", "奶奶的", "奸", 
    "她妈的", "妈了个巴子", "妮马", "尼玛", "屁", "屁股", "屎", "屌", 
    "屌丝", "吊毛", "叼毛", "吃屎", "吹牛逼", "呆逼", "呆子", "呵呵", 
    "咬我啊", "变态", "发情", "去你妈的", "受", "变态", "吹箫", "吃软饭", 
    "咸猪手", "哔哔", "垃圾", "坦胸", "小三", "小白脸", "小气鬼", "小人", 
    "废物", "憨批", "打飞机", "扯淡", "扑街", "找死", "搞基", "擦", 
    "放屁", "智力障碍", "智障", "滚你妈的", "牛逼", "狗东西", "狗屎", 
    "狗娘养的", "狗崽子", "狐狸精", "猪头", "白痴", "神经病", "笨蛋", 
    "绿帽", "绿茶婊", "约炮", "脑残", "脑子进水", "臭流氓", "色狼", 
    "荡妇", "装逼", "裸奔", "贱人", "贱货", "走狗", "踏马的", "特么的", 
    "特么", "畜生", "王八羔子", "王八蛋", "破鞋", "神经病", "禽兽", 
    "绿帽子", "老鸨", "肉棍", "草", "草泥马", "操", "操你妈", "肏", 
    "卧槽", "握草", "我操", "我靠", "靠", "丢雷老母"
],

    "hindi" : [
    "आंडू", "बकचोद", "बकचोदी", "बीसी", "बहनचोद", "भड़वा", "भड़वे", "भड़वी", 
    "भैनचोद", "भोसड़", "भोसड़ी", "भोसड़ीका", "भोसड़ीके", "बुर", "छक्का", 
    "छिनाल", "चिनाल", "चूत", "चूचा", "चूचे", "चूची", "चुट", "चूतड़", 
    "चूतिया", "चुतियापा", "चूतिये", "चूतमारिका", "चुत्तड़", "दल्ला", "दल्ले", 
    "दोगला", "गांड", "गांडफटी", "गांडू", "गंड", "गंदी", "गंडू", "गश्ती", 
    "घश्ती", "गू", "हरामी", "हरामखोर", "हरामजादा", "हरामजादी", "हिजड़ा", 
    "हिजरा", "झांट", "झांटू", "झंट", "झंटू", "कमीना", "कमीने", "कमीने", 
    "कमीनी", "कंजर", "कोठेवाली", "कुत्ता", "कुत्ते", "कुत्ती", "कुतिया", 
    "लवड़ा", "लौड़ा", "लौड़े", "लोड़ा", "लोड़े", "लोडू", "लंड", "लंडफकीर", 
    "माचोद", "मादरचोद", "माधरचोद", "मदरचोद", "एमसी", "मूत", "मुठ", 
    "मुठल", "मुठिया", "मुट्ठ", "नल्ला", "रांड", "रंड", "रांडा", "रांडाप", 
    "रंडी", "रंडवा", "साला", "साले", "साली", "सला", "सली", "सुअर", "टट्टा", 
    "टट्टे", "टट्टी", "टट्टियां", "तवायफ", "ठरकी", "ज़हांट", "ज़हांटू", "झाटू"
],

   "tamil" : [
    "அசிங்கம்", "அயೋಗ್ಯன்", "அரைகிறுக்கு", "அறிவுகெட்டவன்", "அற்பம்", 
    "ஈனப்பிறவி", "எச்ச", "எச்சக்கலை", "எருமை", "ஒக்க", "ஒக்கால", 
    "ஒக்காலோளி", "ஒத்தா", "ஒம்மால", "ஒம்மாலஒக்க", "ஓத்தா", "ஓலு", 
    "கபோதி", "கம்முனாட்டி", "கருமம்", "கழிசடை", "கழுதை", "கண்டறாவி", 
    "கண்டாரோளி", "கிறுக்கு", "குஞ்சி", "குண்டி", "குண்டியா", "குரங்கு", 
    "கூதி", "கூதியனே", "கேடுகெட்டவன்", "கேவலம்", "கோத்தா", "கோமால", 
    "கோழை", "சல்லி", "சனியன்", "சனியன்பிடித்தவன்", "சனியனே", "சாவுக்கிராக்கி", 
    "சில்லறை", "சில்லறைப்பய", "சில்லுண்டி", "சுன்னி", "சுன்னிபய", "சூத்தடி", 
    "சூத்து", "தரித்திரம்", "தறுதலை", "தாயோளி", "தாயோளியின்", "திருடன்", 
    "டுபாக்கூர்", "தேவிடியா", "தேவிடியாபய", "தேவிடியாபையன்", "தேவிடியாமவனே", 
    "நாதாரி", "நாய்", "நாயே", "நாசமாப்போன", "நாறவாயா", "படுபாவி", 
    "பரதேசி", "பன்னி", "பாவி", "பாடு", "பிச்சை", "பிச்சைக்காரன்", "பீ", 
    "பீடை", "பீடையே", "புண்ணாக்கு", "புண்டை", "புண்டைக்கு", "புண்டலஒக்க", 
    "புண்டமவன்", "புண்டமவனே", "பூல்", "பூலு", "பூலுபய", "பேமானி", 
    "பைத்தியம்", "பொட்டை", "பொட்டைபய", "பொறுக்கி", "பொறம்போக்கு", "போக்கிரி", 
    "மயிர்", "மயிரு", "மயிருக்கு", "முட்டாள்", "முண்டம்", "மூதேவி", 
    "மூளையில்லாதவன்", "ரவுடி", "லூசு", "வேசி", "வெண்ணெய்"
],
    
    "nepali": [
    "उल्लु", "कन्तुर", "कपटी", "कलंकिनी", "कवाड", "कुकुर", "कुन्ठित", "कुलच्छिनी", 
    "कृतघ्न", "खच्चड", "खत्तम", "खाते", "गजेडी", "गधा", "गिदी", "गु", "गोबर", 
    "चण्डाल", "चिकने", "चोर", "छक्का", "छाडा", "छली", "छुल्याहा", "छौंडा", 
    "जाँठो", "जाँठा", "जाँड", "जोइटिङ्ग्रे", "झुठो", "झुर", "टोप्या", "ठग", 
    "डँठु", "डाँका", "डाइन", "डम्फु", "ढेडु", "थोत्रो", "धोकेबाज", "नपुंसक", 
    "नामर्द", "नालायक", "पाँडे", "पाजी", "पागल", "पापी", "पिशाच", "पुठ्ठो", 
    "पुँटी", "फटाहा", "फसाहा", "बकवास", "बजिया", "बहुला", "बौलाहा", "बोका", 
    "बोक्सी", "बेबकुफ", "बैगुनी", "भँगेरी", "भतुवा", "भालु", "भाते", "भुतुके", 
    "भुत", "भुस्याहा", "भेडा", "भ्यागुतो", "मगज", "माचिक्ने", "मादरचोद", "मुजी", 
    "मुजि", "मुत", "मुर्कुट्टा", "मोरी", "मोरो", "रद्दी", "रण्डी", "रण्डीकोबान", 
    "रक्सी", "राँड", "राँखे", "लद्दु", "लफङ्गा", "लम्पट", "लाँठो", "लाँडो", 
    "लुच्चा", "लुटेरा", "वाहियात", "सड्के", "साला", "सुँगुर", "सुडेनी", "हड्डी", 
    "हत्यारा", "हरामखोर", "हरामी"
],
    "spanish" : [
    "ano", "asqueroso", "baboso", "bastardo", "bicho", "bolas", "boludo", 
    "burdel", "cabronazo", "cabrón", "caca", "cagar", "cagón", "capullo", 
    "carajo", "cerdo", "cerote", "chibolo", "chimba", "chinga", "chingada", 
    "chingón", "chupa", "chupapollas", "cojones", "comemierda", "conchetumare", 
    "coño", "culear", "culero", "culiado", "culiao", "culo", "diablo", 
    "estúpido", "follar", "gilipollas", "gonorrea", "guarro", "hijueputa", 
    "hostia", "huevón", "huevos", "idiota", "imbécil", "infierno", "joda", 
    "joder", "jodida", "jodido", "lameculos", "machorra", "maldito", "malparido", 
    "mamón", "marica", "maricón", "marrano", "meado", "mear", "mierda", 
    "mongolo", "ojete", "orto", "paja", "pajeador", "pajero", "pelotas", 
    "pelotudo", "pendejo", "perra", "picha", "pija", "pinche", "polla", 
    "prostituta", "puerco", "puta", "putazo", "puticlub", "putita", "puto", 
    "puñeta", "puñetero", "rabo", "ramera", "retrasado", "rosquete", "seno", 
    "singar", "soplapollas", "subnormal", "tarado", "teta", "tocacojones", 
    "tocatejas", "tonto", "tortillera", "verga", "wea", "weón", "zorra"
],


    "telugu" : [
    "అడ్డగాడిద", "అరాచకం", "అజ్ఞాని", "ఉచ్చ", "ఎద్దు", "ఎదవ", "ఏడుపుగొట్టు", "ఏడ్వు", 
    "కంపు", "కసాయి", "కామాంధుడా", "కుక్క", "కుక్కపిల్ల", "కులట", "ఖర్మ", "గలీజ్", 
    "గాడిద", "గుండా", "గుద్ద", "ఛండాలం", "ఛీ", "ఛీపో", "చావడానికే", "చిల్లర", 
    "చిల్లు", "తగలబడు", "తిక్క", "తొత్తు", "త్రాగుబోతు", "దరిద్రం", "దరిద్రుడా", 
    "దిక్కుమాలిన", "దున్నపోతు", "దెంగు", "దెంగించుకో", "దెంగితా", "దెంగేయ్", 
    "దొంగ", "దౌర్భాగ్యుడా", "ద్రోహి", "నక్క", "నాకొడకా", "నాశనం", "నీచ", 
    "నీచుడా", "నీయబ్బ", "నీయమ్మ", "పనికిమాలినోడా", "పనికిరానోడా", "పంది", 
    "పిచ్చోడా", "పీకు", "పీక్కో", "పీనుగు", "పుకు", "పెంట", "పోకిరి", "బట్టేబాజ్", 
    "బలుపు", "బాంచెత్", "బేవర్స్", "బొక్క", "బొచ్చు", "బోసిడికే", "మడ్డ", 
    "మడ్డకుడువు", "మదరచోద్", "మన్ను", "మసి", "మసైపోతావ్", "ముండా", "ముండకొడకా", 
    "మురికి", "మూర్ఖుడా", "మూఢుడా", "మొరుగు", "రంకు", "రంకులాడి", "రౌడీ", 
    "లవడ", "లంజ", "లంజకొడకా", "లంజకొడుకు", "లంజముండ", "వేశ్య", "వెధవ", 
    "వెధవాయ్", "వెర్రి", "వెర్రిపుష్పం", "వెర్రివెధవ", "శవం", "శుంఠ", "సచ్చినోడా", 
    "సన్నాసి", "సర్వనాశనం", "సిగ్గుమాలిన", "సిగ్గులేని", "సుల్లి", "సోమరి", "హరామీ"
],
 
   "french" : [
    "abruti", "andouille", "baiser", "baltringue", "bâtard", "biatch", "bite", 
    "blaireau", "bordel", "bouffon", "branler", "branleur", "cagole", "casse-couilles", 
    "chatte", "chiant", "chiasse", "chier", "chieur", "chieuse", "chiotte", 
    "chiottes", "clochard", "clodo", "con", "connard", "connasse", "conne", 
    "connerie", "couille", "couilles", "couillon", "crétin", "crevard", "crotte", 
    "cul", "débile", "dégueulasse", "démerder", "derche", "emmerder", "emmerdeur", 
    "emmerdeuse", "encule", "enculer", "enculé", "enfoiré", "entuber", "fesse", 
    "fion", "foutre", "foutu", "garce", "gland", "glander", "glandeur", 
    "grognasse", "gueule", "gueuler", "idiot", "imbécile", "lèche-cul", "lopette", 
    "merde", "merdique", "minable", "morue", "naze", "nichons", "nique", 
    "niquer", "ordure", "péter", "pétasse", "pisse", "pisser", "pisseuse", 
    "plouc", "porc", "pouffiasse", "pourriture", "putain", "pute", "queue", 
    "raclure", "roubignoles", "sac-à-merde", "salaud", "salope", "saloperie", 
    "schnock", "suceur", "suceuse", "taré", "teub", "tocard", "traînée", 
    "trou-du-cul", "zizi", "zob"
],

   "german" : [
    "affenarsch", "arsch", "arschgeige", "arschkriecher", "arschloch", "assi", 
    "bastard", "bescheuert", "bitch", "blödmann", "bums", "bumsen", "depp", 
    "dirne", "dreck", "drecksau", "dreckskerl", "dreckssau", "dummkopf", "fick", 
    "ficken", "flachzange", "flittchen", "fotze", "fresse", "hackfresse", 
    "hohlkopf", "holzkopf", "hornochse", "hure", "hurensohn", "idiot", "kackbratze", 
    "kacke", "kacken", "kackfass", "kackwurst", "knalltüte", "korinthenkacker", 
    "kotze", "kotzen", "lackaffe", "lappen", "luder", "lutscher", "lustmolch", 
    "mist", "mistkerl", "miststück", "niete", "nutte", "penner", "pfosten", 
    "pflaume", "pimmel", "pimmelkopf", "pisse", "pissen", "pisser", "pissnelke", 
    "rindvieh", "rotzlöffel", "sackgesicht", "saftsack", "sau", "scheiße", 
    "scheißdreck", "scheißkerl", "schisser", "schlaffie", "schlampe", "schlappschwanz", 
    "schmock", "schmutzfink", "schnepfe", "schwachkopf", "schwanz", "schwanzlutscher", 
    "schwein", "schweinehund", "spießer", "spinner", "stinkstiefel", "stümper", 
    "tölpel", "trottel", "verdammt", "verpiss", "verpissen", "versager", 
    "vollidiot", "votze", "wichse", "wichsen", "wichser", "wichtigtuer", 
    "witzfigur", "wüstling", "zecke", "zicke"
],
   "arabic" : [
    "أحمق", "أخو القحبة", "ابن الحرام", "ابن الزانية", "ابن الشرموطة", "ابن العرص", 
    "ابن القحبة", "ابن الكلب", "ابن المتناكة", "اخسو", "اركب زبي", "استغلالي", 
    "امك", "انقلع", "اهبل", "اير", "ايري", "بغل", "بقر", "بقرة", 
    "بومة", "تتنيّك", "تخلف", "تفو", "تفوه", "تيط", "ثور", "جاسوس", 
    "جبان", "جحش", "جزمة", "حشرة", "حقير", "حمار", "حيوان", "خائن", 
    "خبيث", "خرا", "خنزير", "خنثى", "خول", "ديوث", "رخيص", "رمة", 
    "زبالة", "زبر", "زبي", "زفت", "زنيم", "سافل", "ساقط", "سخيف", 
    "سربوط", "سرسري", "سفلة", "سلق", "شاذ", "شرموطة", "شلق", "شلكة", 
    "صايع", "طيز", "طيزك", "طيزي", "عاهرة", "عبد", "عبيط", "عرص", 
    "علق", "عمى", "غبي", "غدار", "فاسد", "فاشل", "قحبة", "قذر", 
    "قرد", "قزم", "كس", "كسختك", "كسمك", "كلب", "كندرة", "لوطي", 
    "لئيم", "مأبون", "متخلف", "متناك", "مجرم", "مجنون", "مخنث", "مريض", 
    "مستحمر", "مطي", "معرص", "مغفل", "منافق", "منحط", "منيك", "نجس"
],

    "japanese" : [
    "アホ", "あほ", "アンポンタン", "イカレ", "うざい", "ウザい", "うんこ", 
    "エロ", "オカマ", "おこがましい", "おちこぼれ", "おっさん", "お前", "カス", 
    "ガキ", "ガチで", "キモい", "きもい", "キチガイ", "きちがい", "くず", 
    "クズ", "くそ", "クソ", "クソガキ", "くそじじい", "クソジジイ", "くそばばあ", 
    "クソババア", "クソ野郎", "グズ", "けだもの", "ゲス", "げす野郎", "ゴキブリ", 
    "ゴミ", "ごみ", "こんちくしょう", "サイテー", "最低", "サノバビッチ", "しね", 
    "シネ", "死ね", "じゃま", "邪魔", "スカタン", "スケベ", "ズベ公", 
    "ダサい", "たわけ", "チクショウ", "ちくしょう", "畜生", "ちんこ", "チンコ", 
    "ちんぽ", "チンポ", "チンピラ", "てめえ", "テメエ", "てめぇ", "ドアホ", 
    "どあほ", "どけ", "トンマ", "のろま", "ノロマ", "ばか", "バカ", 
    "馬鹿", "バカヤロー", "ばかやろう", "馬鹿野郎", "パクリ", "はげ", "ハゲ", 
    "ビッチ", "ひきこもり", "ブス", "ぶす", "ブタ", "豚", "ふざけるな", 
    "ヘタレ", "へなちょこ", "変態", "へんたい", "ポンコツ", "ボケ", "ぼけ", 
    "マヌケ", "まぬけ", "間抜け", "まんこ", "マンコ", "やりまん", "ヤリマン", 
    "ろくでなし", "ワキガ"
],

    "korean" : [
    "개간년", "개객기", "개같은", "개놈", "개돼지", "개똥", "개라쉑", "개새", 
    "개새끼", "개소리", "개수작", "개씨발", "개자식", "개지랄", "걸레", "고자", 
    "관종", "괸새끼", "구라", "꼬라지", "꼰대", "꼴통", "놈", "니기미", 
    "대가리", "뒈져라", "뒤져", "똘마니", "똥개", "마갈년", "머저리", "멍청이", 
    "미친", "미친년", "미친놈", "미친새끼", "반병신", "발정남", "버러지", "변태", 
    "병신", "보지", "빠가", "빡대가리", "빡쳐", "빡치게", "삥뜯다", "싸가지", 
    "새끼", "썅", "썅년", "썅놈", "쓰레기", "씨발", "씨발년", "씨발놈", 
    "씨발새끼", "씨방새", "씨벌", "씨부랄", "씨불", "씨스발", "씨팍", "씹", 
    "씹물", "씹새", "씹새끼", "씹창", "씹탱", "씹할", "아가리", "양아치", 
    "애자", "엄창", "엠창", "엿먹어", "염병", "옘병", "오라질", "우라질", 
    "육갑", "이년", "이새끼", "잠지", "저년", "저새끼", "존나", "좆", 
    "좆까", "좆나", "좆니", "좆만아", "좆밥", "좆빠지게", "지랄", "창녀", 
    "처먹어", "호구", "호로새끼"
]




}

                
















